share/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/system/snappyHexMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      snappyHexMeshDict;
}

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;
// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
  igloo
  {
    type searchableSphere;
    centre (3 3 0);
    radius 4;
  }
  box1
  {
    type searchableBox;
    min (0 0 0);
    max (1 1 1);
  }
  twoFridgeFreezers
  {
    type searchableSurfaceCollection;
    mergeSubRegions true;
    seal
    {
      surface box1;
      scale (1.0 1.0 2.1);
      transform
      {
        coordinateSystem
        {
          type    cartesian;
          origin  (2 2 0);
          coordinateRotation
          {
            type    axesRotation;
            e1      (1 0 0);
            e3      (0 0 1);
          }
        }
      }
    }
    herring
    {
      surface box1;
      scale (1.0 1.0 2.1);
      transform
      {
        coordinateSystem
        {
          type    cartesian;
          origin  (3.5 3 0);
          coordinateRotation
          {
            type    axesRotation;
            e1      (1 0 0);
            e3      (0 0 1);
          }
        }
      }
    }
  }
};
// Settings for the castellatedMesh generation.
castellatedMeshControls
{
  // Refinement parameters
  // ~~~~~~~~~~~~~~~~~~~~~
  // If local number of cells is >= maxLocalCells on any processor
  // switches from from refinement followed by balancing
  // (current method) to (weighted) balancing before refinement.
  maxLocalCells 100000;
  // Overall cell limit (approximately). Refinement will stop immediately
  // upon reaching this number so a refinement level might not complete.
  // Note that this is the number of cells before removing the part which
  // is not 'visible' from the keepPoint. The final number of cells might
  // actually be a lot less.
  maxGlobalCells 2000000;
  // The surface refinement loop might spend lots of iterations refining just a
  // few cells. This setting will cause refinement to stop if <= minimumRefine
  // are selected for refinement. Note: it will at least do one iteration
  // (unless the number of cells to refine is 0)
  minRefinementCells 100;
  // Number of buffer layers between different levels.
  // 1 means normal 2:1 refinement restriction, larger means slower
  // refinement.
  nCellsBetweenLevels 1;
  // Explicit feature edge refinement
  // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  // Specifies a level for any cell intersected by its edges.
  // This is a featureEdgeMesh, read from constant/triSurface for now.
  features
  (
    {
      file "fridgeA.eMesh";
      levels ((0.01 3));
    }
  );
  // Surface based refinement
  // ~~~~~~~~~~~~~~~~~~~~~~~~
  // Specifies two levels for every surface. The first is the minimum level,
  // every cell intersecting a surface gets refined up to the minimum level.
  // The second level is the maximum level. Cells that 'see' multiple
  // intersections where the intersections make an
  // angle > resolveFeatureAngle get refined up to the maximum level.
  refinementSurfaces
  {
    twoFridgeFreezers
    {
      // Surface-wise min and max refinement level
      level (2 2);
      regions
      {
        // Region-wise override
        "cook.*"
        {
          level (3 3);
        }
      }
      // Optional specification of patch type (default is wall). No
      // constraint types (cyclic, symmetry) etc. are allowed.
      patchInfo
      {
        type        wall;
      }
    }
    "iglo.*"
    {
      // Surface-wise min and max refinement level
      level (1 1);
      // Optional specification of patch type (default is wall). No
      // constraint types (cyclic, symmetry) etc. are allowed.
      patchInfo
      {
        type        wall;
      }
    }
  }
  // Resolve sharp angles on fridges
  resolveFeatureAngle 60;
  // Region-wise refinement
  // ~~~~~~~~~~~~~~~~~~~~~~
  // Specifies refinement level for cells in relation to a surface. One of
  // three modes
  // - distance. 'levels' specifies per distance to the surface the
  //   wanted refinement level. The distances need to be specified in
  //   descending order.
  // - inside. 'levels' is only one entry and only the level is used. All
  //   cells inside the surface get refined up to the level. The surface
  //   needs to be closed for this to be possible.
  // - outside. Same but cells outside.
  refinementRegions
  {
  }
  // Mesh selection
  // ~~~~~~~~~~~~~~
  // After refinement patches get added for all refinementSurfaces and
  // all cells intersecting the surfaces get put into these patches. The
  // section reachable from the locationInMesh is kept.
  // NOTE: This point should never be on a face, always inside a cell, even
  // after refinement.
  locationInMesh (3 0.28 0.43);
  // Whether any faceZones (as specified in the refinementSurfaces)
  // are only on the boundary of corresponding cellZones or also allow
  // free-standing zone faces. Not used if there are no faceZones.
  allowFreeStandingZoneFaces true;
}
// Settings for the snapping.
snapControls
{
  //- Number of patch smoothing iterations before finding correspondence
  //  to surface
  nSmoothPatch 3;
  //- Relative distance for points to be attracted by surface feature point
  //  or edge. True distance is this factor times local
  //  maximum edge length.
  tolerance 2.0;
  //- Number of mesh displacement relaxation iterations.
  nSolveIter 30;
  //- Maximum number of snapping relaxation iterations. Should stop
  //  before upon reaching a correct mesh.
  nRelaxIter 5;
  // Feature snapping
    //- Number of feature edge snapping iterations.
    //  Leave out altogether to disable.
    nFeatureSnapIter 10;
    //- Detect (geometric) features by sampling the surface (default=false)
    implicitFeatureSnap true;
    //- Use castellatedMeshControls::features (default = true)
    explicitFeatureSnap false;
}
// Settings for the layer addition.
addLayersControls
{
  // Are the thickness parameters below relative to the undistorted
  // size of the refined cell outside layer (true) or absolute sizes (false).
  relativeSizes true;
  // Per final patch (so not geometry!) the layer information
  layers
  {
    "two.*"
    {
      nSurfaceLayers 3;
    }
    igloo
    {
      nSurfaceLayers 1;
    }
  }
  // Expansion factor for layer mesh
  expansionRatio 1.0;
  // Wanted thickness of final added cell layer. If multiple layers
  // is the thickness of the layer furthest away from the wall.
  // Relative to undistorted size of cell outside layer.
  // See relativeSizes parameter.
  finalLayerThickness 0.5;
  // Minimum thickness of cell layer. If for any reason layer
  // cannot be above minThickness do not add layer.
  // Relative to undistorted size of cell outside layer.
  // See relativeSizes parameter.
  minThickness 0.25;
  // If points get not extruded do nGrow layers of connected faces that are
  // also not grown. This helps convergence of the layer addition process
  // close to features.
  // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)
  nGrow 0;
  // Advanced settings
  // When not to extrude surface. 0 is flat surface, 90 is when two faces
  // are perpendicular
  featureAngle 60;
  // Maximum number of snapping relaxation iterations. Should stop
  // before upon reaching a correct mesh.
  nRelaxIter 5;
  // Number of smoothing iterations of surface normals
  nSmoothSurfaceNormals 1;
  // Number of smoothing iterations of interior mesh movement direction
  nSmoothNormals 3;
  // Smooth layer thickness over surface patches
  nSmoothThickness 10;
  // Stop layer growth on highly warped cells
  maxFaceThicknessRatio 0.5;
  // Reduce layer growth where ratio thickness to medial
  // distance is large
  maxThicknessToMedialRatio 0.3;
  // Angle used to pick up medial axis points
  // Note: changed(corrected) w.r.t 16x! 90 degrees corresponds to 130 in 16x.
  minMedianAxisAngle 90;
  // Create buffer region for new layer terminations
  nBufferCellsNoExtrude 0;
  // Overall max number of layer addition iterations. The mesher will exit
  // if it reaches this number of iterations; possibly with an illegal
  // mesh.
  nLayerIter 50;
}
// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
  #include "meshQualityDict"
  // Advanced
  //- Number of error distribution iterations
  nSmoothScale 4;
  //- Amount to scale back displacement at error points
  errorReduction 0.75;
}
// Advanced
// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;

// vim: set ft=foam et sw=2 ts=2 sts=2:
