share/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/constant/g
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       uniformDimensionedVectorField;
  location    "constant";
  object      g;
}

dimensions      [0 1 -2 0 0 0 0];
value           (0 0 -9.81);

// vim: set ft=foam et sw=2 ts=2 sts=2:
