share/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/constant/transportProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      transportProperties;
}

transportModel Newtonian;
// Laminar viscosity
nu              [0 2 -1 0 0 0 0] 1e-05;
// Thermal expansion coefficient
beta            [0 0 0 -1 0 0 0] 3e-03;
// Reference temperature
TRef            [0 0 0 1 0 0 0] 300;
// Laminar Prandtl number
Pr              [0 0 0 0 0 0 0] 0.9;
// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0] 0.7;

// vim: set ft=foam et sw=2 ts=2 sts=2:
