share/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/0/alphat
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      alphat;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  wall
  {
    type            alphatJayatillekeWallFunction;
    Prt             0.85;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
