share/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         steadyState;
}
gradSchemes
{
  default         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      bounded Gauss upwind;
  div(phi,T)      bounded Gauss upwind;
  div(phi,k)      bounded Gauss upwind;
  div(phi,epsilon) bounded Gauss upwind;
  div(phi,R)      bounded Gauss upwind;
  div(R)          Gauss linear;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear limited corrected 0.333;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         limited corrected 0.333;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
