share/tutorials/heat-transfer/buoyant-boussinesq-simple/igloo_with_fridges/system/decomposeParDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      decomposeParDict;
}

numberOfSubdomains 2;
method          scotch;
simpleCoeffs
{
  n               (4 1 1);
  delta           0.001;
}
hierarchicalCoeffs
{
  n               (3 2 1);
  delta           0.001;
  order           xyz;
}
manualCoeffs
{
  dataFile        "cellDecomposition";
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
